# Copyright (c) 2026 webAI, Inc.
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# YOLO26 MLX Implementation
# Adapted from Ultralytics YOLO26 for MLX with NHWC format

# Parameters
nc: 80  # number of classes
end2end: True  # whether to use end-to-end mode
reg_max: 1  # DFL bins (1 = no DFL)
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # nano
  s: [0.50, 0.50, 1024]  # small
  m: [0.50, 1.00, 512]   # medium
  l: [1.00, 1.00, 512]   # large
  x: [1.00, 1.50, 512]   # extra-large

# YOLO26 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]  # 9
  - [-1, 2, C2PSA, [1024]]             # 10

# YOLO26 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12 cat backbone P4
  - [-1, 2, C3k2, [512, True]]                   # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15 cat backbone P3
  - [-1, 2, C3k2, [256, True]]                   # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18 cat head P4
  - [-1, 2, C3k2, [512, True]]                   # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21 cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]       # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]              # 23 Detect(P3, P4, P5)
